[
  {"id": "lg-g4", "name": "LG G4", "description": "The next-generation smartphone from LG is here. For everything you watch, capture, store, and more, the LG G4 beautifully combines the latest technology with a classic look and feel."},
  {"id": "samsung-galaxy-s6", "name": "Samsung Galaxy S6", "description": "Experience the beautiful, reinvented Galaxy S6 – Samsung’s most powerful smartphone. And now, nothing’s holding you back, even if you’re stuck with your carrier. T-Mobile will pay off your phones and buy out your contracts. So why wait? Switch and get the Samsung Galaxy S® 6 today!"},
  {"id": "apple-iphone-6", "name": "Apple iPhone 6", "description": "iPhone 6 isn’t just bigger - it’s better in every way. Larger, yet thinner. More powerful, yet power efficient. It’s a new generation of iPhone."},
  {"id": "htc-one-m9", "name": "HTC One M9", "description": "The new HTC One. Enjoy hassle-free premium care for your phone with HTC UH OH Protection at no extra charge."},
  {"id": "apple-iphone-6-plus", "name": "Apple iPhone 6 Plus", "description": "The iPhone 6 Plus is on back order and may delay shipment of other products in your order. iPhone 6 Plus isn’t just bigger - it’s better in every way. A 5.5-inch Retina HD display. An A8 chip with 64-bit desktop-class architecture. A new 8MP iSight camera with Focus Pixels and optical image stabilization. The Touch ID fingerprint identity sensor. Faster LTE and Wi-Fi. Longer battery life. And iOS 8 and iCloud. All in a 7.1mm thin seamless design."},
  {"id": "samsung-galaxy-s6-edge", "name": "Samsung Galaxy S6 edge", "description": "Experience the beautiful, reinvented Galaxy S6 edge – Samsung’s most powerful smartphone. And now, nothing’s holding you back, even if you’re stuck with your carrier. T-Mobile will pay off your phones and buy out your contracts. So why wait? Switch and get the Samsung Galaxy S6 edge today! "},
  {"id": "samsung-galaxy-note4", "name": "Samsung Galaxy Note 4", "description": "Big. Bold. Brilliantly distinctive. The Samsung Galaxy Note 4 delivers in ways that improve how we live, work and play every day."},
  {"id": "apple-iphone-5s", "name": "Apple iPhone 5s", "description": "The highly advanced iPhone 5s features the A7 chip with 64-bit architecture, the Touch ID fingerprint sensor, a new 8-megapixel iSight camera, a new FaceTime HD camera, ultrafast LTE wireless, iOS 7, and iCloud. Yet it’s as thin and light as ever."}
]