[
  {"id": "abc00001", "author": "trungnguyen", "productId": "lg-g4", "rating": 5, "recommended": true, "headline": "Just like the G3, but much better!!!", "content": "This phone has it all! Had the S6 Edge but couldn't stand the freezing and boring UI. The G4 is everything you need with the added benefits of the swappable battery and microSD slot."},
  {"id": "abc00002", "author": "trungnguyen", "productId": "apple-iphone-6", "rating": 4, "recommended": true, "headline": "You need a case to protect it from any damage.", "content": "Its an awesome phone and everything and the screen is excellent and love the camera. So slim, which is a thought to have in mind. Yes it looks nice and clean but I myself, have an iPhone 6 and I have about 5 months with it and i take care of it a lot but I dropped it and it got a dent:/ you can't notice it if I have the case on but what point is there to spend money on a phone when you have to cover it all up and can't show it off? I would like to have to case but ig I have to put it on to protect it. It's a very nice phone overall."},
  {"id": "abc00003", "author": "trungnguyen", "productId": "htc-one-m9", "rating": 3, "recommended": true, "headline": "Not as good as the competition", "content": "This phone wasn't bad but just doesn't compete with the popular phones out right now. I had it for 3 days and returned it because I simply wasn't impressed. The camera was terrible (I was not able to get the software at the time). The display was average but I can't say it was better than the S5 I had previously. The battery life was about a day. I am a light user. I don't have social media and only check email once a day. I do not have any push notifications on. I listen to music for about 2hrs a day. The phone actually has a natural feel to it after a while. The double tap is not like LG because you have to pick the phone up. But the motion itself is really natural."},
  {"id": "abc00004", "author": "trungnguyen", "productId": "samsung-galaxy-note4", "rating": 4, "recommended": true, "headline": "Amazing Phone for Anybody", "content": "When i purchased this device I thought to myself. Will it be too big? or will the interface be too complicated? All of these were put to rest when the phone arrived. I received the device and was amazed by the amazing display and interface features. They were not too complicated to learn and I picked it up very quickly."}
]